# Docker-команда FROM вказує базовий образ контейнера
# Наш базовий образ - це Linux з попередньо встановленим python-3.10
FROM python:3.10

# Встановимо змінну середовища
ENV P_SE_HW1 /hw1

# Встановимо робочу директорію всередині контейнера
WORKDIR $P_SE_HW1

# Встановлюємо poetry
RUN pip install poetry

# Скопіюємо інші файли в робочу директорію контейнера
COPY . .

# Додаємо виконавчий файл Poetry в PATH
#ENV PATH="${PATH}:/root/.poetry/bin"

# Встановимо залежності всередині контейнера
RUN poetry install

# Позначимо порт, де працює застосунок всередині контейнера
EXPOSE 6000

# Запустимо наш застосунок всередині контейнера
ENTRYPOINT ["python", "main.py"]